package org.lnu.is.integration.config.helper

import java.util.Random

object BirthPlace {

  def generate(): String = {
    
    val names = List(
        "81600, м. Миколаїв, проспект Грушевського, 4а", 
        "вул. Руданського, 3, м. Львів, 79005", 
        "вул. Капустяника, 46, м. Львів, 79234", 
        "вул. Кочоптенка, 12, м. Львів, 791221", 
        "вул. Академіка Мирослава, 435, м. Львів, 7912412", 
        "вул. Северина Чорнописенка, 124, м. Львів, 79005", 
        "вул. Нексуса, 12, м. Львів, 79432423", 
        "вул. Макбука, 42, м. Львів, 79412412", 
        "вул. Самойлунка,12 , м. Львів, 79423", 
        "вул. Памели Андерсон, 78, м. Львів, 791212", 
        "вул. Саши Грей, 21, м. Львів, 79"
        )
    
    val random = new Random
    val randomIndex = random.nextInt(names.size)
    
    names(randomIndex)
  }  
  
}