<html><head><title>&#1030;&#1085;&#1090;&#1088;&#1086; &#1087;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;</title><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">.lst-kix_bnwr8xta6ja7-2>li:before{content:"\0025a0  "}.lst-kix_o2k5575qnb69-8>li:before{content:"\0025a0  "}.lst-kix_a3wgf28e35ac-4>li:before{content:"\0025cb  "}.lst-kix_a3wgf28e35ac-0>li:before{content:"\0025cf  "}.lst-kix_o2k5575qnb69-2>li:before{content:"\0025a0  "}.lst-kix_bnwr8xta6ja7-3>li:before{content:"\0025cf  "}.lst-kix_a3wgf28e35ac-3>li:before{content:"\0025cf  "}.lst-kix_bnwr8xta6ja7-4>li:before{content:"\0025cb  "}.lst-kix_a3wgf28e35ac-5>li:before{content:"\0025a0  "}.lst-kix_bnwr8xta6ja7-5>li:before{content:"\0025a0  "}.lst-kix_ez9kmvgn3fj5-0>li:before{content:"\0025cf  "}.lst-kix_a3wgf28e35ac-8>li:before{content:"\0025a0  "}ul.lst-kix_bnwr8xta6ja7-0{list-style-type:none}.lst-kix_ez9kmvgn3fj5-1>li:before{content:"\0025cb  "}ul.lst-kix_bnwr8xta6ja7-1{list-style-type:none}ul.lst-kix_bnwr8xta6ja7-2{list-style-type:none}ul.lst-kix_bnwr8xta6ja7-6{list-style-type:none}ul.lst-kix_bnwr8xta6ja7-5{list-style-type:none}.lst-kix_ez9kmvgn3fj5-4>li:before{content:"\0025cb  "}ul.lst-kix_bnwr8xta6ja7-4{list-style-type:none}.lst-kix_bnwr8xta6ja7-1>li:before{content:"\0025cb  "}ul.lst-kix_bnwr8xta6ja7-3{list-style-type:none}.lst-kix_o2k5575qnb69-1>li:before{content:"\0025cb  "}ul.lst-kix_bnwr8xta6ja7-8{list-style-type:none}ul.lst-kix_bnwr8xta6ja7-7{list-style-type:none}.lst-kix_bnwr8xta6ja7-8>li:before{content:"\0025a0  "}.lst-kix_bnwr8xta6ja7-7>li:before{content:"\0025cb  "}.lst-kix_o2k5575qnb69-7>li:before{content:"\0025cb  "}.lst-kix_o2k5575qnb69-5>li:before{content:"\0025a0  "}.lst-kix_ez9kmvgn3fj5-8>li:before{content:"\0025a0  "}.lst-kix_ez9kmvgn3fj5-3>li:before{content:"\0025cf  "}.lst-kix_o2k5575qnb69-4>li:before{content:"\0025cb  "}ul.lst-kix_a3wgf28e35ac-7{list-style-type:none}ul.lst-kix_a3wgf28e35ac-6{list-style-type:none}ul.lst-kix_a3wgf28e35ac-8{list-style-type:none}.lst-kix_a3wgf28e35ac-7>li:before{content:"\0025cb  "}ul.lst-kix_a3wgf28e35ac-3{list-style-type:none}ul.lst-kix_a3wgf28e35ac-2{list-style-type:none}ul.lst-kix_a3wgf28e35ac-5{list-style-type:none}ul.lst-kix_a3wgf28e35ac-4{list-style-type:none}.lst-kix_ez9kmvgn3fj5-7>li:before{content:"\0025cb  "}.lst-kix_bnwr8xta6ja7-0>li:before{content:"\0025cf  "}.lst-kix_a3wgf28e35ac-6>li:before{content:"\0025cf  "}.lst-kix_a3wgf28e35ac-2>li:before{content:"\0025a0  "}.lst-kix_ez9kmvgn3fj5-5>li:before{content:"\0025a0  "}.lst-kix_a3wgf28e35ac-1>li:before{content:"\0025cb  "}ul.lst-kix_ez9kmvgn3fj5-7{list-style-type:none}ul.lst-kix_ez9kmvgn3fj5-6{list-style-type:none}ul.lst-kix_ez9kmvgn3fj5-5{list-style-type:none}ul.lst-kix_ez9kmvgn3fj5-4{list-style-type:none}ul.lst-kix_o2k5575qnb69-7{list-style-type:none}.lst-kix_o2k5575qnb69-6>li:before{content:"\0025cf  "}ul.lst-kix_o2k5575qnb69-8{list-style-type:none}.lst-kix_o2k5575qnb69-0>li:before{content:"\0025cf  "}ul.lst-kix_ez9kmvgn3fj5-8{list-style-type:none}.lst-kix_ez9kmvgn3fj5-6>li:before{content:"\0025cf  "}ul.lst-kix_o2k5575qnb69-3{list-style-type:none}.lst-kix_o2k5575qnb69-3>li:before{content:"\0025cf  "}ul.lst-kix_o2k5575qnb69-4{list-style-type:none}ul.lst-kix_o2k5575qnb69-5{list-style-type:none}ul.lst-kix_o2k5575qnb69-6{list-style-type:none}ul.lst-kix_ez9kmvgn3fj5-3{list-style-type:none}ul.lst-kix_o2k5575qnb69-0{list-style-type:none}ul.lst-kix_ez9kmvgn3fj5-2{list-style-type:none}ul.lst-kix_o2k5575qnb69-1{list-style-type:none}ul.lst-kix_ez9kmvgn3fj5-1{list-style-type:none}ul.lst-kix_o2k5575qnb69-2{list-style-type:none}ul.lst-kix_ez9kmvgn3fj5-0{list-style-type:none}.lst-kix_bnwr8xta6ja7-6>li:before{content:"\0025cf  "}ul.lst-kix_a3wgf28e35ac-0{list-style-type:none}ul.lst-kix_a3wgf28e35ac-1{list-style-type:none}.lst-kix_ez9kmvgn3fj5-2>li:before{content:"\0025a0  "}ol{margin:0;padding:0}.c3{padding-left:0pt;line-height:1.428571;padding-top:3pt;widows:2;orphans:2;direction:ltr;margin-left:174pt;padding-bottom:8pt}.c2{padding-left:0pt;line-height:1.428571;padding-top:3pt;widows:2;orphans:2;direction:ltr;margin-left:58pt;padding-bottom:8pt}.c1{widows:2;orphans:2;height:11pt;direction:ltr}.c9{padding-top:3pt;text-align:left;margin-left:72pt;padding-bottom:8pt}.c4{line-height:1.428571;widows:2;orphans:2;direction:ltr}.c7{padding-left:0pt;padding-top:3pt;margin-left:116pt;padding-bottom:8pt}.c6{max-width:468pt;background-color:#ffffff;padding:72pt 72pt 72pt 72pt}.c5{margin:0;padding:0}.c8{line-height:1.428571}.c0{font-weight:bold}.c10{color:#047ac6}.title{widows:2;padding-top:0pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:21pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}.subtitle{widows:2;padding-top:0pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-style:italic;font-size:13pt;font-family:"Trebuchet MS";padding-bottom:10pt;page-break-after:avoid}li{color:#000000;font-size:11pt;font-family:"Arial"}p{color:#000000;font-size:11pt;margin:0;font-family:"Arial"}h1{widows:2;padding-top:10pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:16pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h2{widows:2;padding-top:10pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:13pt;font-family:"Trebuchet MS";font-weight:bold;padding-bottom:0pt;page-break-after:avoid}h3{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:12pt;font-family:"Trebuchet MS";font-weight:bold;padding-bottom:0pt;page-break-after:avoid}h4{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:11pt;text-decoration:underline;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h5{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:11pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h6{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-style:italic;font-size:11pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}</style></head><body class="c6"><p class="c4"><span>&#1055;&#1077;&#1088;&#1096;&#1077;. &#1096;&#1086; &#1093;&#1086;&#1095;&#1077;&#1090;&#1100;&#1089;&#1103; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1080; - &#1074;&#1080; &#1079;&#1073;&#1080;&#1088;&#1072;&#1108;&#1090;&#1077;&#1089;&#1100; &#1087;&#1080;&#1089;&#1072;&#1090;&#1080; </span><span class="c0">&#1089;&#1077;&#1088;&#1074;&#1110;&#1089; &#1076;&#1083;&#1103; &#1074;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1111; &#1082;&#1072;&#1084;&#1087;&#1072;&#1085;&#1110;&#1111; &#1074; &#1085;&#1072;&#1074;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091; &#1079;&#1072;&#1082;&#1083;&#1072;&#1076;&#1110;</span><span>. &#1058;&#1077;&#1089;&#1090;&#1086;&#1074;&#1086; &#1094;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1073;&#1091;&#1076;&#1077; &#1089;&#1090;&#1072;&#1088;&#1090;&#1091;&#1074;&#1072;&#1090;&#1080; &#1074; &#1051;&#1100;&#1074;&#1110;&#1074;&#1089;&#1100;&#1082;&#1086;&#1084;&#1091; &#1053;&#1072;&#1094;&#1110;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091; &#1059;&#1085;&#1110;&#1074;&#1077;&#1088;&#1089;&#1080;&#1090;&#1077;&#1090;&#1110; &#1110;&#1084;&#1077;&#1085;&#1110; &#1030;&#1074;&#1072;&#1085;&#1072; &#1060;&#1088;&#1072;&#1085;&#1082;&#1072;. &#1061;&#1086;&#1095;&#1077;&#1090;&#1100;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1080; &#1076;&#1077;&#1082;&#1110;&#1083;&#1100;&#1082;&#1072; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1110;&#1074;, &#1103;&#1082;&#1110; &#1074;&#1072;&#1084; &#1074;&#1072;&#1088;&#1090;&#1086; &#1079;&#1085;&#1072;&#1090;&#1080;</span></p><ul class="c5 lst-kix_a3wgf28e35ac-0 start"><li class="c2"><span>&#1055;&#1110;&#1089;&#1083;&#1103; &#1088;&#1077;&#1083;&#1110;&#1079;&#1091; &#1110; &#1073;&#1086;&#1081;&#1086;&#1074;&#1086;&#1075;&#1086; &#1074;&#1080;&#1082;&#1086;&#1088;&#1080;&#1089;&#1090;&#1072;&#1085;&#1085;&#1103; &#1076;&#1072;&#1085;&#1086;&#1111; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1080; &#1084;&#1080; &#1088;&#1086;&#1079;&#1084;&#1110;&#1089;&#1090;&#1080;&#1084;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1072; &#1075;&#1110;&#1090;&#1093;&#1072;&#1073; &#1110; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1084;&#1086; &#1074;&#1072;&#1089; &#1103;&#1082; &#1082;&#1086;&#1084;&#1110;&#1090;&#1077;&#1088;&#1110;&#1074; &#1087;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;. &#1055;&#1088;&#1086;&#1077;&#1082;&#1090; &#1073;&#1091;&#1076;&#1077; &#1086;&#1087;&#1077;&#1085;&#1089;&#1086;&#1088;&#1089;&#1085;&#1080;&#1081;, &#1110;, &#1103;&#1082;&#1097;&#1086; &#1087;&#1086;&#1097;&#1072;&#1089;&#1090;&#1080;&#1090;&#1100;, &#1073;&#1091;&#1076;&#1077; &#1074;&#1080;&#1082;&#1086;&#1088;&#1080;&#1089;&#1090;&#1086;&#1074;&#1091;&#1074;&#1072;&#1090;&#1080;&#1089;&#1100; &#1085;&#1077; &#1090;&#1110;&#1083;&#1100;&#1082;&#1080; &#1074; &#1051;&#1053;&#1059; &#1074; &#1051;&#1100;&#1074;&#1086;&#1074;&#1110;.</span></li><li class="c2"><span>&#1052;&#1080;, &#1073;&#1077;&#1082;&#1077;&#1085;&#1076; &#1095;&#1072;&#1089;&#1090;&#1080;&#1085;&#1072;, &#1087;&#1088;&#1086;&#1074;&#1072;&#1081;&#1076;&#1072;&#1108;&#1084;&#1086; &#1074;&#1072;&#1084; </span><span class="c0">RESTful</span><span>&nbsp;&#1074;&#1077;&#1073; &#1089;&#1077;&#1088;&#1074;&#1110;&#1089;, &#1079; &#1103;&#1082;&#1080;&#1084; &#1074;&#1072;&#1084; &#1087;&#1086;&#1090;&#1088;&#1110;&#1073;&#1085;&#1086; &#1079;&#1110;&#1085;&#1090;&#1077;&#1075;&#1088;&#1091;&#1074;&#1072;&#1090;&#1080;&#1089;&#1100;.</span></li><li class="c2"><span>&#1042; &#1085;&#1072;&#1089; &#1108; &#1089;&#1077;&#1082;&#1102;&#1088;&#1110;&#1090;&#1110;. &#1055;&#1086;&#1082;&#1080;&#1097;&#1086; &#1094;&#1077; </span><span class="c0">Basic Auth </span><span>, &#1074; &#1084;&#1072;&#1081;&#1073;&#1091;&#1090;&#1085;&#1100;&#1086;&#1084;&#1091; &#1087;&#1083;&#1072;&#1085;&#1091;&#1108;&#1084;&#1086; Single Sign On, &#1090;&#1072;&#1082; &#1103;&#1082; &#1091;&#1085;&#1110;&#1074;&#1077;&#1088;&#1089;&#1080;&#1090;&#1077;&#1090; &#1084;&#1072;&#1108; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091; &#1085;&#1077; &#1090;&#1110;&#1083;&#1100;&#1082;&#1080; &#1074; &#1086;&#1076;&#1085;&#1110;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1110; &#1042;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1111; &nbsp;&#1050;&#1072;&#1084;&#1087;&#1072;&#1085;&#1110;&#1111;, &#1110;, &#1087;&#1086; &#1084;&#1110;&#1088;&#1110; &#1088;&#1086;&#1079;&#1074;&#1080;&#1090;&#1082;&#1091; &#1092;&#1088;&#1086;&#1085;&#1090;&#1077;&#1085;&#1076; &#1072;&#1087;&#1083;&#1110;&#1082;&#1077;&#1081;&#1096;&#1080;&#1085;&#1110;&#1074;, &#1085;&#1072;&#1084; &#1087;&#1086;&#1090;&#1088;&#1110;&#1073;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077; &#1108;&#1076;&#1080;&#1085;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1072;&#1074;&#1090;&#1086;&#1088;&#1080;&#1079;&#1072;&#1094;&#1110;&#1111;.</span></li><li class="c2"><span>&#1052;&#1080; &#1073;&#1091;&#1076;&#1077;&#1084;&#1086; &#1090;&#1110;&#1083;&#1100;&#1082;&#1080; &#1088;&#1072;&#1076;&#1110;, &#1103;&#1082;&#1097;&#1086; &#1087;&#1110;&#1089;&#1083;&#1103; &#1088;&#1077;&#1083;&#1110;&#1079;&#1091; &#1074;&#1080; &#1074;&#1080;&#1103;&#1074;&#1080;&#1090;&#1077; &#1073;&#1072;&#1078;&#1072;&#1085;&#1085;&#1103; &#1087;&#1088;&#1072;&#1094;&#1102;&#1074;&#1072;&#1090;&#1080; &#1076;&#1072;&#1083;&#1110; &#1085;&#1072;&#1076; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084;.</span></li><li class="c2"><span>&#1042; &#1085;&#1072;&#1089; &#1108; &#1076;&#1078;&#1077;&#1085;&#1082;&#1110;&#1085;&#1089;, &#1110; &#1084;&#1080;(&#1103;) &#1076;&#1091;&#1078;&#1077; &#1090;&#1077;&#1089;&#1090;-&#1086;&#1088;&#1110;&#1108;&#1085;&#1090;&#1086;&#1074;&#1072;&#1085;&#1110;. &#1054;&#1076;&#1085;&#1072;&#1082;, &#1074; &#1089;&#1080;&#1083;&#1091; &#1090;&#1086;&#1075;&#1086;, &#1097;&#1086; &#1091;&#1085;&#1110;&#1074;&#1077;&#1088;&#1089;&#1080;&#1090;&#1077;&#1090;, &#1103;&#1082; &#1110; &#1083;&#1102;&#1073;&#1072; &#1110;&#1085;&#1096;&#1072; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;, &#1103;&#1082;&#1072; &#1110;&#1089;&#1085;&#1091;&#1108; &#1076;&#1072;&#1074;&#1085;&#1086;, &#1085;&#1077; &#1076;&#1091;&#1078;&#1077; &#1072;&#1076;&#1072;&#1087;&#1090;&#1091;&#1074;&#1072;&#1083;&#1072;&#1089;&#1100; &#1076;&#1086; &#1074;&#1080;&#1082;&#1083;&#1080;&#1082;&#1110;&#1074; &#1110;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1110;&#1081;&#1085;&#1080;&#1093; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1110;&#1081;, &#1090;&#1086;&#1084;&#1091; &#1074;&#1080;&#1082;&#1083;&#1072;&#1076;&#1072;&#1095;&#1072;&#1084;, &#1110; &#1082;&#1077;&#1088;&#1110;&#1074;&#1085;&#1080;&#1094;&#1090;&#1074;&#1091;, &#1103;&#1082;&#1077;, &#1074;&#1083;&#1072;&#1089;&#1085;&#1077;, &#1079;&#1072;&#1090;&#1088;&#1077;&#1073;&#1091;&#1074;&#1072;&#1083;&#1086; &#1094;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091;, &#1085;&#1077; &#1076;&#1091;&#1078;&#1077; &#1079;&#1088;&#1086;&#1079;&#1091;&#1084;&#1110;&#1083;&#1086;, &#1097;&#1086; &#1090;&#1072;&#1082;&#1077; &#1030;&#1058;, &#1110; &#1079; &#1095;&#1080;&#1084; &#1081;&#1086;&#1075;&#1086; &#1082;&#1091;&#1096;&#1090;&#1091;&#1074;&#1072;&#1090;&#1080;. &#1058;&#1086;&#1084;&#1091;, &#1103; &#1073;&#1091;&#1076;&#1091; &#1090;&#1110;&#1083;&#1100;&#1082;&#1080; &#1088;&#1072;&#1076;&#1080;&#1081;, &#1103;&#1082;&#1097;&#1086; &#1074;&#1080;, &#1092;&#1088;&#1086;&#1085;&#1090;&#1077;&#1085;&#1076; &#1088;&#1086;&#1079;&#1088;&#1086;&#1073;&#1085;&#1080;&#1082;&#1080;, &#1079; &#1088;&#1086;&#1079;&#1091;&#1084;&#1110;&#1085;&#1085;&#1103;&#1084; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1077;&#1089;&#1100; &#1076;&#1086; &#1073;&#1072;&#1075;&#1110;&#1074;, &#1103;&#1082;&#1110; &#1084;&#1086;&#1078;&#1091;&#1090; &#1110;&#1089;&#1085;&#1091;&#1074;&#1072;&#1090;&#1080; &#1085;&#1072; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1110;, &#1110; &#1087;&#1086;&#1074;&#1110;&#1076;&#1086;&#1084;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086; &#1094;&#1077; &#1085;&#1072;&#1089;.</span></li><li class="c2"><span>&#1071; &#1085;&#1077;&#1079;&#1085;&#1072;&#1102; &#1074;&#1089;&#1110;&#1093; &#1074;&#1072;&#1096;&#1080;&#1093; &#1110;&#1084;&#1077;&#1085;, &#1072;&#1083;&#1077; &#1103; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086; &#1074;&#1076;&#1103;&#1095;&#1085;&#1080;&#1081; &#1074;&#1072;&#1084; &#1079;&#1072; &#1090;&#1077;, &#1097;&#1086; &#1074;&#1080; &#1079;&#1088;&#1086;&#1073;&#1080;&#1090;&#1077;. &#1047;&#1085;&#1072;&#1083;&#1080; &#1073; &#1074;&#1080;, &#1103;&#1082; &#1094;&#1077; &#1074;&#1072;&#1078;&#1082;&#1086; &#1089;&#1087;&#1110;&#1083;&#1082;&#1091;&#1074;&#1072;&#1090;&#1080;&#1089;&#1100; &#1079; &quot;&#1087;&#1088;&#1086;&#1092;&#1077;&#1089;&#1086;&#1088;&#1072;&#1084;&#1080;&quot;, &#1110; &#1087;&#1088;&#1086;&#1073;&#1091;&#1074;&#1072;&#1090;&#1080; &#1087;&#1086;&#1103;&#1089;&#1085;&#1080;&#1090;&#1080; &#1111;&#1084;, &#1079;&#1076;&#1072;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100;, &#1079;&#1074;&#1080;&#1095;&#1072;&#1081;&#1085;&#1110; &#1088;&#1077;&#1095;&#1110;.</span></li><li class="c2"><span>&#1071;&#1082;&#1097;&#1086; &#1074; &#1074;&#1072;&#1089; &#1073;&#1091;&#1076;&#1091;&#1090;&#1100; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1088;&#1086;&#1076;&#1091; &#1087;&#1080;&#1090;&#1072;&#1085;&#1085;&#1103;, &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1111;&#1093; &#1084;&#1077;&#1085;&#1110; </span><span class="c10">Ivanon2@gmail.com</span><span>&nbsp;, </span><span class="c0">skype</span><span>&nbsp;- Ivanon1992</span></li></ul><p class="c4"><span>&#1054;&#1090;&#1078;&#1077;, &#1079;&#1076;&#1072;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100; &#1073;&#1080;, &#1076;&#1083;&#1103; &#1095;&#1086;&#1075;&#1086; &#1094;&#1077;&#1081; &#1089;&#1077;&#1088;&#1074;&#1110;&#1089; ?</span></p><p class="c4"><span>&#1051;&#1100;&#1074;&#1110;&#1074;&#1089;&#1100;&#1082;&#1086;&#1084;&#1091; &#1053;&#1072;&#1094;&#1110;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091; &#1059;&#1085;&#1110;&#1074;&#1077;&#1088;&#1089;&#1080;&#1090;&#1077;&#1090;&#1110;(&#1085;&#1072;&#1076;&#1072;&#1083;&#1110; - &#1051;&#1053;&#1059;) &#1074;&#1110;&#1085; &#1087;&#1086;&#1090;&#1088;&#1110;&#1073;&#1077;&#1085; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1097;&#1086;&#1073; &#1082;&#1088;&#1072;&#1097;&#1077; &#1074;&#1110;&#1076;&#1089;&#1090;&#1077;&#1078;&#1091;&#1074;&#1072;&#1090;&#1080; &#1110;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1110;&#1102; &#1087;&#1088;&#1086; &#1074;&#1089;&#1090;&#1091;&#1087;&#1085;&#1091; &#1082;&#1072;&#1084;&#1087;&#1072;&#1085;&#1110;&#1102;, &#1097;&#1086;&#1073; &#1084;&#1086;&#1085;&#1110;&#1090;&#1086;&#1088;&#1080;&#1090;&#1080; &#1072;&#1073;&#1110;&#1090;&#1091;&#1108;&#1085;&#1090;&#1110;&#1074;, &#1097;&#1086;&#1073; &#1087;&#1086;&#1079;&#1073;&#1072;&#1074;&#1080;&#1090;&#1080;&#1089;&#1100; &#1082;&#1086;&#1088;&#1091;&#1087;&#1094;&#1110;&#1111;, </span></p><p class="c1 c8"><span></span></p><p class="c4"><span>&#1056;&#1086;&#1079;&#1087;&#1080;&#1096;&#1091; &#1076;&#1077;&#1103;&#1082;&#1110; &#1074;&#1080;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1103;</span></p><p class="c4"><span class="c0">&#1056;&#1077;&#1089;&#1091;&#1088;&#1089;</span><span>&nbsp;- &#1094;&#1077; &#1086;&#1076;&#1080;&#1085;&#1080;&#1094;&#1103; &#1089;&#1091;&#1090;&#1085;&#1086;&#1089;&#1090;&#1110;. &#1055;&#1110;&#1076; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1084; &#1084;&#1080; &#1084;&#1086;&#1078;&#1077;&#1084;&#1086; &#1088;&#1086;&#1079;&#1091;&#1084;&#1110;&#1090;&#1080; &#1055;&#1077;&#1088;&#1089;&#1086;&#1085;&#1091;, &#1044;&#1077;&#1087;&#1072;&#1088;&#1090;&#1072;&#1084;&#1077;&#1085;&#1090;, &#1047;&#1072;&#1103;&#1074;&#1091; &#1110; &#1090;&#1076;. &#1053;&#1072;&#1076;&#1072;&#1083;&#1110; &#1087;&#1072;&#1084;&#1103;&#1090;&#1072;&#1081;&#1090;&#1077; &#1087;&#1088;&#1086; &#1094;&#1077;.</span></p><p class="c1 c8"><span></span></p><p class="c1 c8"><span></span></p><p class="c4"><span>&#1071;&#1082;&#1097;&#1086; &#1074;&#1080; &#1075;&#1083;&#1103;&#1085;&#1077;&#1090;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1110;&#1102;, &#1090;&#1086; &#1087;&#1086;&#1073;&#1072;&#1095;&#1080;&#1090;&#1077;, &#1097;&#1086; &#1074;&#1086;&#1085;&#1072; &#1087;&#1086;&#1076;&#1110;&#1083;&#1077;&#1085;&#1072; &#1087;&#1086; &#1089;&#1091;&#1090;&#1085;&#1086;&#1089;&#1090;&#1103;&#1093;(persons, departments). &#1042; &#1089;&#1074;&#1086;&#1102; &#1095;&#1077;&#1088;&#1075;&#1091;, &#1082;&#1086;&#1078;&#1085;&#1072; &#1089;&#1091;&#1090;&#1085;&#1110;&#1089;&#1090;&#1100; &#1084;&#1086;&#1078;&#1077; &#1084;&#1110;&#1089;&#1090;&#1080;&#1090;&#1080; &#1072;&#1073;&#1086; 2 &#1084;&#1077;&#1090;&#1086;&#1076;&#1080; &#1072;&#1073;&#1086; 5 &#1084;&#1077;&#1090;&#1086;&#1076;&#1080;. :</span></p><ul class="c5 lst-kix_bnwr8xta6ja7-0 start"><li class="c2"><span>&#1056;&#1086;&#1079;&#1087;&#1080;&#1096;&#1091; &#1103;&#1082;&#1110; &#1073;&#1091;&#1074;&#1072;&#1102;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076;&#1080;.</span></li></ul><ul class="c5 lst-kix_bnwr8xta6ja7-1 start"><li class="c4 c7"><span class="c0">GET &#1084;&#1085;&#1086;&#1078;&#1080;&#1085;&#1085;&#1080;&#1081;</span><span>.&#1060;&#1072;&#1082;&#1090;&#1080;&#1095;&#1085;&#1086;, &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1079;&#1080;&#1074;&#1072;&#1090;&#1080; &#1094;&#1077;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; - &#1087;&#1086;&#1096;&#1091;&#1082;&#1086;&#1084;, &#1086;&#1089;&#1082;&#1110;&#1083;&#1100;&#1082;&#1080; &#1074; &#1082;&#1086;&#1078;&#1085;&#1110;&#1081; API &#1108; &#1084;&#1086;&#1078;&#1083;&#1080;&#1074;&#1110;&#1089;&#1090;&#1100; &#1092;&#1110;&#1083;&#1100;&#1090;&#1088;&#1091;&#1074;&#1072;&#1090;&#1080; &#1094;&#1077;&#1081; &#1084;&#1085;&#1086;&#1078;&#1080;&#1085;&#1085;&#1080;&#1081; &#1087;&#1086;&#1096;&#1091;&#1082; &#1087;&#1086; &#1087;&#1077;&#1074;&#1085;&#1080;&#1093; &#1087;&#1086;&#1083;&#1103;&#1093;, &#1103;&#1082;&#1110; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1110; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1110;&#1111;. &#1042;&#1080;&#1082;&#1083;&#1080;&#1082;&#1072;&#1074;&#1096;&#1080; &#1094;&#1077;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076;, &#1074;&#1080; &#1086;&#1090;&#1088;&#1080;&#1084;&#1072;&#1108;&#1090;&#1077; &#1079;&#1072;&#1075;&#1072;&#1083;&#1100;&#1085;&#1091; &#1110;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1110;&#1102; &#1087;&#1086; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1093; &#1079; &#1094;&#1110;&#1108;&#1111; &#1089;&#1091;&#1090;&#1085;&#1086;&#1089;&#1090;&#1110;.&#1058;&#1072;&#1084; &#1073;&#1091;&#1076;&#1077;:</span></li></ul><ul class="c5 lst-kix_bnwr8xta6ja7-2 start"><li class="c3"><span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&#1047;&#1072;&#1075;&#1072;&#1083;&#1100;&#1085;&#1072; &#1082;&#1110;&#1083;&#1100;&#1082;&#1110;&#1089;&#1090;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1110;&#1074; &#1074; &#1073;&#1072;&#1079;&#1110; &#1087;&#1086; &#1076;&#1072;&#1085;&#1086;&#1084;&#1091; &#1087;&#1086;&#1096;&#1091;&#1082;&#1091; (</span><span class="c0">count</span><span>)</span></li><li class="c3"><span>&#1057;&#1090;&#1072;&#1088;&#1090;&#1086;&#1074;&#1072; &#1087;&#1086;&#1079;&#1080;&#1094;&#1110;&#1103;, &#1079; &#1103;&#1082;&#1086;&#1111; &#1074;&#1080; &#1087;&#1086;&#1095;&#1080;&#1085;&#1072;&#1108;&#1090;&#1077; &#1087;&#1086;&#1096;&#1091;&#1082;(</span><span class="c0">offset</span><span>)</span></li><li class="c3"><span>Limit &#1079;&#1072;&#1087;&#1080;&#1089;&#1110;&#1074;, &#1103;&#1082;&#1110; &#1074;&#1080; &#1086;&#1090;&#1088;&#1080;&#1084;&#1072;&#1108;&#1090;&#1077;.&#1042;&#1088;&#1072;&#1093;&#1091;&#1081;&#1090;&#1077;, &#1097;&#1086; &#1089;&#1077;&#1088;&#1074;&#1110;&#1089; &#1085;&#1077; &#1074;&#1080;&#1076;&#1072;&#1089;&#1090;&#1100; &#1074;&#1072;&#1084; &#1073;&#1110;&#1083;&#1100;&#1096;&#1077; &#1085;&#1110;&#1078; </span><span class="c0">500</span><span>&nbsp;&#1079;&#1072;&#1087;&#1080;&#1089;&#1110;&#1074; - </span><span class="c0">limit</span></li><li class="c3"><span>&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1110;&#1074;. &#1058;&#1072;&#1084; &#1074;&#1078;&#1077; &#1073;&#1091;&#1076;&#1077; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1110;&#1074;, &#1103;&#1082;&#1080;&#1081; &#1074;&#1080;&#1076;&#1072;&#1089;&#1090;&#1100; &#1074;&#1072;&#1084; &#1089;&#1077;&#1088;&#1074;&#1110;&#1089;.</span></li></ul><ul class="c5 lst-kix_bnwr8xta6ja7-1"><li class="c4 c7"><span class="c0">GET by ID</span><span>. &#1047;&#1072; &#1094;&#1080;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; &#1074;&#1080; &#1086;&#1090;&#1088;&#1080;&#1084;&#1072;&#1108;&#1090;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1091; &#1110;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1110;&#1102; &#1087;&#1088;&#1086; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1080;&#1081; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;. &#1058;&#1072;&#1084; &#1073;&#1091;&#1076;&#1091;&#1090;&#1100; &#1076;&#1086;&#1076;&#1072;&#1090;&#1082;&#1086;&#1074;&#1110; &#1087;&#1086;&#1083;&#1103;, &#1087;&#1088;&#1072;&#1074;&#1076;&#1072;, &#1087;&#1077;&#1088;&#1077;&#1074;&#1072;&#1078;&#1085;&#1086;, &#1074;&#1086;&#1085;&#1080; &#1108; &#1090;&#1077;&#1093;&#1085;&#1110;&#1095;&#1085;&#1110; &#1110; &#1085;&#1072; &#1094;&#1100;&#1086;&#1084;&#1091; &#1077;&#1090;&#1072;&#1087;&#1110; &#1088;&#1086;&#1079;&#1074;&#1080;&#1090;&#1082;&#1091; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090;&#1100; &#1082;&#1086;&#1088;&#1080;&#1089;&#1085;&#1110; &#1092;&#1088;&#1086;&#1085;&#1090;&#1077;&#1085;&#1076;&#1091;. &#1065;&#1086;&#1073; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1080;&#1090;&#1080;&#1089;&#1100; &#1076;&#1086; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1091; &#1087;&#1086; &#1072;&#1081;&#1076;&#1110;&#1096;&#1094;&#1110;, &#1087;&#1086;&#1090;&#1088;&#1110;&#1073;&#1085;&#1086; &#1074;&#1080;&#1082;&#1083;&#1080;&#1082;&#1072;&#1090;&#1080; &#1096;&#1086;&#1089;&#1100; &#1085;&#1072; &#1082;&#1096;&#1090;&#1072;&#1082;&#1090; </span><span class="c0">/resources/{id}</span><span>, &#1076;&#1077; </span><span class="c0">resource</span><span>&nbsp;- &#1094;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072; &#1074;&#1110;&#1076;&#1087;&#1086;&#1074;&#1110;&#1076;&#1085;&#1086;&#1111; &#1089;&#1091;&#1090;&#1085;&#1086;&#1089;&#1090;&#1110;</span></li><li class="c4 c7"><span class="c0">Create Resource(Person, Department, etc...)</span><span>.&#1044;&#1077;&#1103;&#1082;&#1110; &#1092;&#1072;&#1082;&#1090;&#1080;:</span></li></ul><ul class="c5 lst-kix_bnwr8xta6ja7-2 start"><li class="c3"><span>&#1042;&#1072;&#1084; &#1079;&#1072;&#1074;&#1078;&#1076;&#1080; &#1087;&#1086;&#1090;&#1088;&#1110;&#1073;&#1085;&#1086; &#1089;&#1090;&#1074;&#1086;&#1088;&#1102;&#1074;&#1072;&#1090;&#1080; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089; &#1079;&#1072; &#1076;&#1086;&#1087;&#1086;&#1084;&#1086;&#1075;&#1086;&#1102; </span><span class="c0">POST</span><span>&nbsp;&#1084;&#1077;&#1090;&#1086;&#1076;&#1091;.</span></li><li class="c3"><span>&#1042;&#1072;&#1084; &#1079;&#1072;&#1074;&#1078;&#1076;&#1080; &#1087;&#1086;&#1090;&#1088;&#1110;&#1073;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077; &#1074;&#1110;&#1076;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1080; </span><span class="c0">JSON </span><span>&#1085;&#1072; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;.</span></li><li class="c3"><span>&#1042;&#1080; &#1079;&#1072;&#1074;&#1078;&#1076;&#1080; &#1087;&#1086;&#1074;&#1080;&#1085;&#1085;&#1110; &#1086;&#1095;&#1110;&#1082;&#1091;&#1074;&#1072;&#1090;&#1080; </span><span class="c0">http status 201 </span><span>&nbsp;&#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1074;&#1110;&#1088;&#1082;&#1080; &#1091;&#1089;&#1087;&#1110;&#1096;&#1085;&#1086;&#1089;&#1090;&#1110; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1110;&#1111;.</span></li><li class="c3"><span>&#1053;&#1072; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1110; &#1110;&#1089;&#1085;&#1091;&#1108; &#1074;&#1072;&#1083;&#1110;&#1076;&#1072;&#1094;&#1110;&#1103;. &#1071;&#1082;&#1097;&#1086; &#1074;&#1080; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1077; &#1085;&#1077;&#1074;&#1072;&#1083;&#1110;&#1076;&#1085;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1103; &#1074; </span><span class="c0">POST/PUT</span><span>&nbsp;&#1079;&#1072;&#1087;&#1080;&#1090;, &#1090;&#1086; &#1086;&#1090;&#1088;&#1080;&#1084;&#1072;&#1108;&#1090;&#1077; http status - </span><span class="c0">422</span><span>&nbsp;&#1110; </span><span class="c0">json</span><span>&nbsp;&#1084;&#1077;&#1089;&#1077;&#1076;&#1078; &#1079; &#1087;&#1077;&#1088;&#1077;&#1083;&#1110;&#1082;&#1086;&#1084; &#1087;&#1086;&#1083;&#1077;&#1081;, &#1103;&#1082;&#1110; &nbsp;&#1085;&#1077; &#1108; &#1074;&#1072;&#1083;&#1110;&#1076;&#1085;&#1110;.</span></li></ul><p class="c4 c9"><span class="c0">Update Resource(Person, Department, etc...)</span><span>.&#1044;&#1077;&#1103;&#1082;&#1110; &#1092;&#1072;&#1082;&#1090;&#1080;</span></p><ul class="c5 lst-kix_bnwr8xta6ja7-2"><li class="c3"><span>&#1042;&#1072;&#1084; &#1079;&#1072;&#1074;&#1078;&#1076;&#1080; &#1087;&#1086;&#1090;&#1088;&#1110;&#1073;&#1085;&#1086; &#1089;&#1090;&#1074;&#1086;&#1088;&#1102;&#1074;&#1072;&#1090;&#1080; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089; &#1079;&#1072; &#1076;&#1086;&#1087;&#1086;&#1084;&#1086;&#1075;&#1086;&#1102; </span><span class="c0">PUT</span><span>&nbsp;&#1084;&#1077;&#1090;&#1086;&#1076;&#1091;.</span></li><li class="c3"><span>&#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1085;&#1086; &#1074; &#1074;&#1089;&#1110;&#1093; &#1074;&#1080;&#1087;&#1072;&#1076;&#1082;&#1072;&#1093;, &#1103;&#1082;&#1097;&#1086; </span><span class="c0">uri </span><span>&#1084;&#1085;&#1086;&#1078;&#1080;&#1085;&#1085;&#1080;&#1081; &#1079;&#1072;&#1087;&#1080;&#1090; &#1108;,&#1076;&#1086; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1091; </span><span class="c0">/persons </span><span>, &#1090;&#1086; &#1076;&#1083;&#1103; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1103; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1091; &#1074;&#1072;&#1084; &#1087;&#1086;&#1090;&#1088;&#1110;&#1073;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1080; &#1076;&#1086; &#1094;&#1100;&#1086;&#1075;&#1086; uri &#1083;&#1080;&#1096;&#1077; id &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1091;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076; </span><span class="c0">/persons/1</span><span>.&#1058;&#1072;&#1082;&#1072; &#1078; &#1083;&#1086;&#1075;&#1110;&#1082;&#1072; &#1089;&#1090;&#1086;&#1089;&#1091;&#1108;&#1090;&#1100;&#1089;&#1103; Get </span><span class="c0">&nbsp;</span><span>&nbsp;</span></li><li class="c3"><span>&#1042;&#1072;&#1084; &#1079;&#1072;&#1074;&#1078;&#1076;&#1080; &#1087;&#1086;&#1090;&#1088;&#1110;&#1073;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077; &#1074;&#1110;&#1076;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1080; </span><span class="c0">JSON </span><span>&#1085;&#1072; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;.</span></li><li class="c3"><span>&#1042;&#1080; &#1079;&#1072;&#1074;&#1078;&#1076;&#1080; &#1087;&#1086;&#1074;&#1080;&#1085;&#1085;&#1110; &#1086;&#1095;&#1110;&#1082;&#1091;&#1074;&#1072;&#1090;&#1080; </span><span class="c0">http status 200 </span><span>&nbsp;&#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1074;&#1110;&#1088;&#1082;&#1080; &#1091;&#1089;&#1087;&#1110;&#1096;&#1085;&#1086;&#1089;&#1090;&#1110; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1110;&#1111;.</span></li><li class="c3"><span>&#1053;&#1072; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1110; &#1110;&#1089;&#1085;&#1091;&#1108; &#1074;&#1072;&#1083;&#1110;&#1076;&#1072;&#1094;&#1110;&#1103;. &#1071;&#1082;&#1097;&#1086; &#1074;&#1080; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1077; &#1085;&#1077;&#1074;&#1072;&#1083;&#1110;&#1076;&#1085;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1103; &#1074; </span><span class="c0">POST/PUT</span><span>&nbsp;&#1079;&#1072;&#1087;&#1080;&#1090;, &#1090;&#1086; &#1086;&#1090;&#1088;&#1080;&#1084;&#1072;&#1108;&#1090;&#1077; http status - </span><span class="c0">422</span><span>&nbsp;&#1110; </span><span class="c0">json</span><span>&nbsp;&#1084;&#1077;&#1089;&#1077;&#1076;&#1078; &#1079; &#1087;&#1077;&#1088;&#1077;&#1083;&#1110;&#1082;&#1086;&#1084; &#1087;&#1086;&#1083;&#1077;&#1081;, &#1103;&#1082;&#1110; &#1085;&#1077; &#1108; &#1074;&#1072;&#1083;&#1110;&#1076;&#1085;&#1110;.</span></li></ul><ul class="c5 lst-kix_bnwr8xta6ja7-1"><li class="c4 c7"><span class="c0">Delete Resource.</span><span>&nbsp;</span><span class="c0">/resources/{id}</span><span>&nbsp;, &#1076;&#1077; resources - &#1085;&#1072;&#1079;&#1074;&#1072; &#1074;&#1110;&#1076;&#1087;&#1086;&#1074;&#1110;&#1076;&#1085;&#1086;&#1111; &#1089;&#1091;&#1090;&#1085;&#1086;&#1089;&#1090;&#1110; &#1074; &#1084;&#1085;&#1086;&#1078;&#1080;&#1085;&#1110;(persons, departments, ...)</span></li></ul><ul class="c5 lst-kix_bnwr8xta6ja7-2 start"><li class="c3"><span>&#1065;&#1086;&#1073; &#1074;&#1080;&#1076;&#1072;&#1083;&#1080;&#1090;&#1080;, &#1087;&#1086;&#1090;&#1088;&#1110;&#1073;&#1085;&#1086; &#1074;&#1080;&#1082;&#1083;&#1080;&#1082;&#1072;&#1090;&#1080; &#1094;&#1077; </span><span class="c0">uri</span><span>&nbsp;&#1079; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; </span><span class="c0">DELETE</span></li><li class="c3"><span>&#1042;&#1080; &#1087;&#1086;&#1074;&#1080;&#1085;&#1085;&#1110; &#1086;&#1090;&#1088;&#1080;&#1084;&#1072;&#1090;&#1080; &#1089;&#1090;&#1072;&#1090;&#1091;&#1089; 204 - No Content</span></li></ul><p class="c1"><span></span></p></body></html>